fast_finish_2026/LR5/buoyantCavity/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication foamRun
runApplication -s sample foamPostProcess -latestTime -func sample

runApplication validation/createGraphs

#------------------------------------------------------------------------------
